<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"management","backend":"1620bcf6a5d7cca5c041e39bb32f1c27503307db2f46c94fbeebf822ff9721c1","plan_job_ref":"Job Tests for PRs #107 at https://github.com/GSA-TTS/FAC/actions/runs/4827686003","plan_hash":"89c701b926cdfffc7559373194b83edc617a4e675f884654a1686cc98e7f1c36","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __management__
<details>
<summary>Plan: 20 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudfoundry_service_instance.space-deployer["dev"] will be created
  + resource "cloudfoundry_service_instance" "space-deployer" {
      + id                             = (known after apply)
      + name                           = "dev-deployer"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "space-deployer"
      + space                          = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
    }

  # cloudfoundry_service_instance.space-deployer["management"] will be created
  + resource "cloudfoundry_service_instance" "space-deployer" {
      + id                             = (known after apply)
      + name                           = "management-deployer"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "space-deployer"
      + space                          = "a5f333be-68d4-46a7-a9c6-e22ec7eb3fb3"
    }

  # cloudfoundry_service_instance.space-deployer["production"] will be created
  + resource "cloudfoundry_service_instance" "space-deployer" {
      + id                             = (known after apply)
      + name                           = "production-deployer"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "space-deployer"
      + space                          = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

  # cloudfoundry_service_instance.space-deployer["staging"] will be created
  + resource "cloudfoundry_service_instance" "space-deployer" {
      + id                             = (known after apply)
      + name                           = "staging-deployer"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "space-deployer"
      + space                          = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
    }

  # cloudfoundry_service_key.space-deployer-key["dev"] will be created
  + resource "cloudfoundry_service_key" "space-deployer-key" {
      + credentials      = (known after apply)
      + id               = (known after apply)
      + name             = "dev-deployer-key"
      + service_instance = (known after apply)
    }

  # cloudfoundry_service_key.space-deployer-key["management"] will be created
  + resource "cloudfoundry_service_key" "space-deployer-key" {
      + credentials      = (known after apply)
      + id               = (known after apply)
      + name             = "management-deployer-key"
      + service_instance = (known after apply)
    }

  # cloudfoundry_service_key.space-deployer-key["production"] will be created
  + resource "cloudfoundry_service_key" "space-deployer-key" {
      + credentials      = (known after apply)
      + id               = (known after apply)
      + name             = "production-deployer-key"
      + service_instance = (known after apply)
    }

  # cloudfoundry_service_key.space-deployer-key["staging"] will be created
  + resource "cloudfoundry_service_key" "space-deployer-key" {
      + credentials      = (known after apply)
      + id               = (known after apply)
      + name             = "staging-deployer-key"
      + service_instance = (known after apply)
    }

  # cloudfoundry_space.space["dev-egress"] will be created
  + resource "cloudfoundry_space" "space" {
      + allow_ssh  = true
      + asgs       = [
          + "c515ab7a-c05a-40c7-b2fe-146a457336a8",
          + "c70d6061-4da3-4cbb-bd8e-c9982a5e8b22",
        ]
      + auditors   = (known after apply)
      + developers = (known after apply)
      + id         = (known after apply)
      + managers   = (known after apply)
      + name       = "dev-egress"
      + org        = "d030fa77-d07d-4164-8f15-25dbc1c04f44"
    }

  # cloudfoundry_space.space["management-egress"] will be created
  + resource "cloudfoundry_space" "space" {
      + allow_ssh  = true
      + asgs       = [
          + "c515ab7a-c05a-40c7-b2fe-146a457336a8",
          + "c70d6061-4da3-4cbb-bd8e-c9982a5e8b22",
        ]
      + auditors   = (known after apply)
      + developers = (known after apply)
      + id         = (known after apply)
      + managers   = (known after apply)
      + name       = "management-egress"
      + org        = "d030fa77-d07d-4164-8f15-25dbc1c04f44"
    }

  # cloudfoundry_space.space["production-egress"] will be created
  + resource "cloudfoundry_space" "space" {
      + allow_ssh  = false
      + asgs       = [
          + "c515ab7a-c05a-40c7-b2fe-146a457336a8",
          + "c70d6061-4da3-4cbb-bd8e-c9982a5e8b22",
        ]
      + auditors   = (known after apply)
      + developers = (known after apply)
      + id         = (known after apply)
      + managers   = (known after apply)
      + name       = "production-egress"
      + org        = "d030fa77-d07d-4164-8f15-25dbc1c04f44"
    }

  # cloudfoundry_space.space["staging-egress"] will be created
  + resource "cloudfoundry_space" "space" {
      + allow_ssh  = true
      + asgs       = [
          + "c515ab7a-c05a-40c7-b2fe-146a457336a8",
          + "c70d6061-4da3-4cbb-bd8e-c9982a5e8b22",
        ]
      + auditors   = (known after apply)
      + developers = (known after apply)
      + id         = (known after apply)
      + managers   = (known after apply)
      + name       = "staging-egress"
      + org        = "d030fa77-d07d-4164-8f15-25dbc1c04f44"
    }

  # cloudfoundry_space_users.egress-deployer["dev"] will be created
  + resource "cloudfoundry_space_users" "egress-deployer" {
      + auditors   = (known after apply)
      + developers = (known after apply)
      + force      = false
      + id         = (known after apply)
      + managers   = (known after apply)
      + space      = (known after apply)
    }

  # cloudfoundry_space_users.egress-deployer["management"] will be created
  + resource "cloudfoundry_space_users" "egress-deployer" {
      + auditors   = (known after apply)
      + developers = (known after apply)
      + force      = false
      + id         = (known after apply)
      + managers   = (known after apply)
      + space      = (known after apply)
    }

  # cloudfoundry_space_users.egress-deployer["production"] will be created
  + resource "cloudfoundry_space_users" "egress-deployer" {
      + auditors   = (known after apply)
      + developers = (known after apply)
      + force      = false
      + id         = (known after apply)
      + managers   = (known after apply)
      + space      = (known after apply)
    }

  # cloudfoundry_space_users.egress-deployer["staging"] will be created
  + resource "cloudfoundry_space_users" "egress-deployer" {
      + auditors   = (known after apply)
      + developers = (known after apply)
      + force      = false
      + id         = (known after apply)
      + managers   = (known after apply)
      + space      = (known after apply)
    }

  # cloudfoundry_space_users.space_permissions["dev-egress"] will be created
  + resource "cloudfoundry_space_users" "space_permissions" {
      + auditors   = (known after apply)
      + developers = [
          + "alexander.steel@gsa.gov",
          + "bret.mogilefsky@gsa.gov",
          + "daniel.swick@gsa.gov",
          + "edward.zapata@gsa.gov",
          + "hassandeme.mamasambo@gsa.gov",
          + "james.person@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "lindsayn.young@gsa.gov",
          + "matt.henry@gsa.gov",
          + "matthew.jadud@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
          + "timothy.ballard@gsa.gov",
        ]
      + force      = false
      + id         = (known after apply)
      + managers   = [
          + "540d4f62-7b33-4fb4-a25c-1a112754c004",
          + "bret.mogilefsky@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
        ]
      + space      = (known after apply)
    }

  # cloudfoundry_space_users.space_permissions["management-egress"] will be created
  + resource "cloudfoundry_space_users" "space_permissions" {
      + auditors   = (known after apply)
      + developers = [
          + "alexander.steel@gsa.gov",
          + "bret.mogilefsky@gsa.gov",
          + "daniel.swick@gsa.gov",
          + "edward.zapata@gsa.gov",
          + "hassandeme.mamasambo@gsa.gov",
          + "james.person@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "lindsayn.young@gsa.gov",
          + "matt.henry@gsa.gov",
          + "matthew.jadud@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
          + "timothy.ballard@gsa.gov",
        ]
      + force      = false
      + id         = (known after apply)
      + managers   = [
          + "540d4f62-7b33-4fb4-a25c-1a112754c004",
          + "bret.mogilefsky@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
        ]
      + space      = (known after apply)
    }

  # cloudfoundry_space_users.space_permissions["production-egress"] will be created
  + resource "cloudfoundry_space_users" "space_permissions" {
      + auditors   = (known after apply)
      + developers = [
          + "alexander.steel@gsa.gov",
          + "bret.mogilefsky@gsa.gov",
          + "daniel.swick@gsa.gov",
          + "edward.zapata@gsa.gov",
          + "hassandeme.mamasambo@gsa.gov",
          + "james.person@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "lindsayn.young@gsa.gov",
          + "matt.henry@gsa.gov",
          + "matthew.jadud@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
          + "timothy.ballard@gsa.gov",
        ]
      + force      = false
      + id         = (known after apply)
      + managers   = [
          + "540d4f62-7b33-4fb4-a25c-1a112754c004",
          + "bret.mogilefsky@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
        ]
      + space      = (known after apply)
    }

  # cloudfoundry_space_users.space_permissions["staging-egress"] will be created
  + resource "cloudfoundry_space_users" "space_permissions" {
      + auditors   = (known after apply)
      + developers = [
          + "alexander.steel@gsa.gov",
          + "bret.mogilefsky@gsa.gov",
          + "daniel.swick@gsa.gov",
          + "edward.zapata@gsa.gov",
          + "hassandeme.mamasambo@gsa.gov",
          + "james.person@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "lindsayn.young@gsa.gov",
          + "matt.henry@gsa.gov",
          + "matthew.jadud@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
          + "timothy.ballard@gsa.gov",
        ]
      + force      = false
      + id         = (known after apply)
      + managers   = [
          + "540d4f62-7b33-4fb4-a25c-1a112754c004",
          + "bret.mogilefsky@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
        ]
      + space      = (known after apply)
    }

Plan: 20 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Tests for PRs #107](https://github.com/GSA-TTS/FAC/actions/runs/4827686003)